export default {
    yes: 'Да',
    no: 'Нет',
    you: 'Это вы',
    add: 'Добавить',
    added: 'Добавлен',
    not_added: 'Не добавлен',
    delete: 'Удалить',
    choose: "Выбрать",
    choose_an_option: "Выберите вариант",
    choose_your_option: "Выберите свой вариант",
    download: "Скачать",
    loading: "Идет загрузка",
    template: "Шаблон",
    export_to_png: "Экспорт в PNG",
    export_to_xlsx: "Экспорт в XLSX",
    export_to_pdf: "Экспорт в PDF",
    download_pdf: "Скачать PDF",
    click_to_listen_to_the_audio: "Кликните чтобы прослушать аудио",
    all_rights: 'Все права защищены.',
    choose_your_language: 'Выберите Ваш язык',
    choose_a_mentor: 'Выберите куратора',
    choose_a_category: 'Выберите категорию',
    continue: 'Продолжить',
    merge: "Объединить",
    split: "Разделить",
    move_up: "Переместить вверх",
    move_down: "Переместить вниз",
    move_left: "Переместить влево",
    move_right: "Переместить вправо",
    save: 'Сохранить',
    saving: 'Сохранение',
    restart: 'Перезагрузить',
    edit: "Редактировать",
    welcome: 'Добро пожаловать',
    on_air: 'На связи',
    or: 'Или',
    back: 'Назад',
    close: 'Закрыть',
    check: 'Проверить',
    swap_places: 'Поменять местами',
    an_error_occurred: 'Произошла ошибка',
    nothing_was_found_for_your_query: "По вашему запросу ничего не найдено",
    time_is_up: "Время вышло!",
    write_here_and_press_add: "Напишите здесь и затем нажмите на кнопку 'Добавить'",

    sort_by_this_column: 'Сортировать по данному столбцу',
    sort_asc: 'Сортировка по возрастанию',
    sort_desc: 'Сортировка по убыванию',

    status: "Статус",
    invite: "Пригласить",
    search: "Искать",
    accept: "Принять",
    step_num: "Шаг {num}",

    operator: "Оператор",
    executor: "Исполнитель",
    mentor: "Куратор",
    applicant: "Заявитель",
    recipient: "Получатель",
    selected: "Выбрано",
    not_selected: "Не выбран",
    not_specified: "Не указан",
    your_answer: "Ваш ответ",
    title: "Заголовок",
    text_center: "Текст по центру",
    true: "Правда",
    false: "Ложь",
    "doesn't_say": "Нет упоминания",
    right: "Правильно!",
    wrong: "Неправильно!",
    right_answer: "Правильный ответ",
    right_answers: "Правильные ответы",
    wrong_answer: "Неправильный ответ",
    wrong_answers: "Неправильные ответы",
    answer_options: "Варианты ответа",
    for_re_examination: "Для повторного изучения",
    get_ready: "Приготовьтесь",
    number_of_options: "Количество вариантов",
    number_of_attempts: "Количество попыток на исправление ошибок",
    random_order: "Выводить в случайном порядке",

    created_at: "Дата создания",
    created_at_from: "Дата создания (с)",
    created_at_to: "Дата создания (по)",
    registered_at: "Дата регистрации",
    registered_at_from: "Дата регистрации (с)",
    registered_at_to: "Дата регистрации (по)",

    reset_search_filter: "Сбросить фильтр",
    show_search_filter: 'Показать фильтр поиска',
    hide_search_filter: 'Скрыть фильтр поиска',
    clear: 'Сбросить',

    subject_type: 'Выберите тип субъекта',
    legal_entity: 'Юридическое лицо',
    natural_person: 'Физическое лицо',
    personal_data: 'Персональные данные',
    legal_entity_data: 'Сведения о юридическом лице',

    theme: {
        switch_to_a_light_theme: "Переключиться на светлую тему",
        switch_to_a_dark_theme: "Переключиться на темную тему"
    },

    text: {
        editor: "Текстовый редактор",
        welcome: "Вы можете редактировать данный текст",
        bold: "Жирный",
        italic: "Курсивный",
        underline: "Подчеркнутый",
        strikethrough: "Зачеркнутый",
        title: "Заголовок",
        li: "Маркерный список",
        ol: "Нумерованный список",
        text_left: "Выравнивание по левому краю",
        text_center: "Выравнивание по центру",
        text_right: "Выравнивание по правому краю"
    },

    table: {
        title: "Таблица",
        work: "Работа с таблицей",
        create: "Создать таблицу",
        add: "Добавить таблицу",
        merge: "Объединить выделенное",
        copy_and_paste_the_table_here: "Скопируйте таблицу и вставьте сюда",
        rows: {
            count: "Количество строк",
            add: "Добавить строку",
            delete: "Удалить строки",
            required: "Укажите количество строк"
        },
        columns: {
            count: "Количество столбцов",
            add: "Добавить столбец",
            delete: "Удалить столбцы",
            required: "Укажите количество столбцов"
        },

        delete: {
            title: "Удалить таблицу",
            title_alt: "Удаление таблицы",
            confirm: "Вы действительно хотите удалить данную таблицу?"
        },

        table_options: "Настройки таблицы",
        has_header: "Таблица с заголовками",
        is_small: "Компактная таблица",
        is_striped: "Полосатая таблица",
        is_bordered: "Таблица с границей",
        error_1: "Количество строк и столбцов должно быть выше 1",
        error_2: "Нельзя удалять все строки!",
        error_3: "Нельзя удалять все столбцы!",
        error_4: "Для начала Вам нужно создать таблицу",
        confirm_1: "Вы уверены, что хотите удалить таблицу?",

        custom: {
            title: 'Произвольная таблица'
        },

        repayment_schedule: {
            title: 'График погашения'
        }
    },

    errors: {
        server_error: 'Ошибка на стороне сервера',
        canceled_by_user: 'Отменено пользоваетелем',
        failed_to_connect_ncalayer: 'Не удалось подключиться к NCALayer',
        signature_was_not_accept: 'Сервер не принял подпись',
        page_is_not_available: "Эта страница недоступна для данной роли",
        show_error: "Показать ошибку",
        hide_error: "Скрыть ошибку",

        server: {
            error: 'Невозможно подключиться к серверу. Проверьте соединение с интернетом.',
            room_error: 'Не удается войти в конференцию. Попробуйте перезагрузить страницу.',
            peer_error: 'Не удается установить P2P соединение.  Проверьте соединение с интернетом.'
        },
        statuses: {
            status_undefined: "Неизвестная ошибка!",
            status_400: "Непредвиденная ошибка на сервере",
            status_401: "Вы не авторизованы",
            status_403: "Доступ к данной странице запрещен",
            status_404: "Запрашиваемая страница не найдена",
            status_429: "Слишком много попыток, повторите попытку позже",
            status_500: "Ошибка на стороне сервера"
        },

        sigex: {
            iin: "Документ могут подписать только указанные в нём стороны. Пожалуйста, убедитесь, что вы используете ЭЦП, оформленную на ИИН одной из сторон или её официального представителя. Если ключ выбран верно, проверьте, правильно ли указаны ИИН сторон в самом документе."
        }
    },

    pagination: {
        first_page_title: "Перейти на первую страницу",
        previous_page_title: "Перейти на предыдущую страницу",
        next_page_title: "Перейти на следующую страницу",
        last_page_title: "Перейти на последнюю страницу",
        limit_per_page: "Лимит на страницу",
        unlimit: "Без ограничении",
        shown: "Показано: {shown} из {total}"
    },

    form: {
        email: 'E-Mail',
        name: {
            title: 'Имя',
            required: 'Заполните поле "Имя"'
        },
        last_name: {
            title: 'Фамилия',
            required: 'Заполните поле "Фамилия"'
        },
        given_name: {
            title: 'Отчество',
            required: 'Заполните поле "Отчество"'
        },
        iin: {
            title: 'ИИН',
            required: 'Заполните ИИН'
        },
        bin: {
            title: 'БИН или ИИН',
            required: 'Заполните БИН или ИИН'
        },
        company_name: {
            title: 'Полное наименование юр-лица',
            required: 'Заполните наименование юр-лица'
        },

        phone: {
            title: 'Телефон',
            required: 'Заполните номер телефона',
            last4: {
                title: 'Последние 4 цифры номера телефона',
                required: 'Введите последние 4 цифры номера телефона',
                not_found: 'Номер телефона с таким окончанием не зарегистрирован в данном документе'
            }
        },

        birth_date: {
            title: 'Дата рождения',
            required: 'Заполните дату рождения'
        },

        residential_address: {
            title: 'Адрес проживания',
            required: 'Заполните адрес проживания',
            select: 'Выберите адрес проживания'
        },

        password: 'Пароль',
        confirm_password: 'Подтвердите пароль',
        select_a_point: 'Выберите населенный пункт',
        country: 'Страна',
        region: 'Регион',
        city: 'Город',
        village: {
            title: 'Село, поселок',
            required: 'Заполните название села или поселка'
        },
        street: {
            title: 'Улица, микрорайон',
            required: 'Заполните улицу, микрорайон'
        },
        house: {
            title: '№ дома',
            required: 'Заполните № дома'
        },
        building: {
            title: 'Здание №',
            required: 'Заполните № здания'
        },
        flat: 'Квартира',
        cabinet: 'Кабинет',
        legal_form: 'Форма юридического лица',
        select_legal_form: 'Выберите форму юридического лица',

        post: 'Должность',
        select_post: 'Выберите должность',

        attorney: {
            title: 'Сведения о доверенном лице и доверенности',
            representative: 'Представитель',
            is_available: 'Имеется доверенное лицо',
            type: {
                title: 'Тип доверенности',
                required: 'Выберите тип доверенности'
            },
            num: {
                title: '№ доверенности',
                required: 'Заполните № доверенности'
            },
            date: {
                title: 'Дата выдачи доверенности',
                required: 'Заполните дату выдачи доверенности'
            },
        },

        select_an_agreement_type: 'Выберите тип соглашения'
    },

    site: {
        description: 'Заключение медиативного соглашения'
    },

    pages: {
        home: {
            title: 'Главная страница',
            hello: 'Добро пожаловать',
            to: "На главную страницу",
        },
        profile: {
            title: 'Мой профиль',
        },
        users: {
            title: 'Пользователи',
            invite_user_title: "Приглашение нового пользователя",
            edit_user_title: "Редактирование данных пользователя",
            user_mode: 'Моя текущая роль',
            user_info: "Информация о пользователе",
            user_status: "Статус пользователя",
            user_role: "Роль пользователя",
            select_user_roles: "Выберите роль-(и) для нового пользователя",
            search_filter: "Фильтр поиска пользователей",
        },
        auth: {
            title: 'Вход в систему',
            sign_in: 'Войти',
            sign: {
                sign_with_ncalayer: 'Войти через NCALayer',
                sign_with_ncalayer_description: 'Только через компьютер или ноутбук',
                sign_with_qr_code: 'Войти через QR код',
                sign_with_qr_code_description: 'С помощью смартфона через eGov Mobile или eGov Business',
            },
            dont_have_an_account: "Нет аккаунта?",

            select_links: {
                title: 'Кликните по одной из этих кнопок для подписания в соответствующем приложении на этом устройстве',
                item_1: 'Подписать в eGov Mobile как физическое лицо',
                item_2: 'Подписать в eGov Business как юридическое лицо'
            }
        },

        logout: {
            title: 'Выйти из аккаунта',
            please_wait: 'Пожалуйста подождите, идет выход из аккаунта'
        },

        dashboard: {
            title: 'Личный кабинет',
            main_wallet: 'Основной кошелёк',
            go_to_dashboard: 'В личный кабинет'
        },

        documents: {
            view: {
                title: 'Просмотр документа',
                description: 'Для просмотра документа пожалуйста войдите в личный кабинет',
                access_denied: 'Доступ к документу запрещён. Ваш ИИН не указан среди сторон данного документа',
                loading: 'Пожалуйста подождите, идет загрузка документа',
            },
            contract: {
                title: 'Договор',
                prepayment: 'Предоплата',
                award: 'Вознаграждение',
                status: 'Статус договора'
            },
            agreement: {
                title: 'Соглашение',
                create: 'Создать соглашение',
                create_alt: 'Создание соглашения',
                edit: 'Редактировать соглашение',
                edit_alt: 'Редактирование соглашения',
                open: 'Прочитать соглашение',
                new: 'Новое соглашение',
                search_filter: 'Поиск соглашении',
                agreement_type: 'Тип соглашения',
                sign: 'Подписание соглашения',
                status: 'Статус соглашения',
                form: 'Формирование соглашения',
                preview: 'Предпросмотр',
                custom_template: {
                    add: 'Создать шаблон',
                    save: 'Сохранить шаблон соглашения для дальнейшего использования',
                    save_changes: 'Сохранить изменения в шаблоне',
                    name: 'Название для шаблона',
                    select: 'Выберите шаблон',
                    empty: {
                        title: 'Вы ещё не создали ни одного шаблона соглашения',
                        description: 'Создайте шаблон, чтобы быстро использовать его в будущем'
                    }
                },
                empty: {
                    title: 'У вас пока нет ни одного соглашения. Для того чтобы начать работу создайте первое соглашение.'
                },

                permissions: {
                    title: 'Соглашение можно редактировать только в этих случаях:',
                    initiator: 'Когда вы являетесь инициатором данного соглашения',
                    signed_by_all: 'Соглашение еще не подписано всеми сторонами'
                }
            },

            point: {
                title: 'Пункт',
                add: 'Добавить пункт',

                sub: {
                    title: 'Подпункт',
                    add: 'Добавить подпункт'
                }
            },

            initiator: 'Инициатор',

            mediator: {
                title: 'Медиатор',
                data: 'Данные медиатора',
                select: {
                    title: 'Выбор медиатора',
                    required: 'Выберите медиатора'
                },
                association_name_short: {
                    title: 'Короткое название общественного объединения',
                    required: 'Укажите короткое название общественного объединения'
                },
                association_name_full: {
                    title: 'Полное название общественного объединения',
                    required: 'Укажите полное название общественного объединения'
                },
                cert_num: {
                    title: '№ сертификата',
                    required: 'Укажите № сертификата'
                },
                cert_date: {
                    title: 'Дата выдачи сертификата',
                    required: 'Укажите дату выдачи сертификата'
                }
            },

            parties: 'Стороны',
            party: 'Сторона',
            party_1: 'Сторона 1',
            party_2: 'Сторона 2',
            party_3: 'Сторона 3',
            add_party: 'Добавить сторону',

            select_agreement_type: 'Выбор типа соглашения',

            payment_data: 'Сведения о платеже',

            monthly: {
                amount: {
                    title: 'Сумма ежемесячного платежа',
                    required: 'Укажите сумму ежемесячного платежа'
                },
                count: {
                    title: 'Количество ежемесячных платежей',
                    required: 'Укажите количество ежемесячных платежей'
                }
            },

            daily: {
                amount: {
                    title: 'Сумма ежедневного платежа',
                    required: 'Укажите сумму ежедневного платежа'
                },
                count: {
                    title: 'Количество ежедневных платежей',
                    required: 'Укажите количество ежедневных платежей'
                }
            },

            start_payment_date: {
                title: 'Дата начала платежа',
                required: 'Укажите дату платежа'
            },

            sign: {
                agreement: 'Подписать соглашение',
                contract: 'Подписать договор',
                signed: 'Подписано',
                pending: 'Подпись ожидается',
                status: 'Статус',
                at: 'Дата и время подписания',
                sign_with_ncalayer: 'Подписать через NCALayer',
                sign_with_qr_code: 'Подписать через QR код',
                verify: {
                    title: 'Проверка подписей',
                    title_alt: 'Проверить подпись',
                    step_1: 'Скачайте .cms файл из сайта на ваше устройство',
                    step_2: 'Откройте сайт {site}',
                    step_3: 'Выберите .cms файл загруженное на ваше устройство на сайте',
                    open_site: 'Открыть сайт',
                    download_file: 'Скачать файл'
                }
            },

            attributes: {
                amount_of_debt: {
                    title: 'Сумма долга',
                },
                loan: {
                    repayment_start_date: 'Дата начала погашения',
                    repayment_period: 'Срок погашения (в месяцах)',
                    repayment_terms: 'Условия погашения',
                    lender: {
                        details: {
                            title: 'Реквизиты заимодавца',
                            iik: 'ИИК (IBAN)',
                            bik: 'БИК',
                            bank_name: 'Название банка'
                        }
                    }
                },
                basis_for_issuing_loan: {
                    title: 'Основание для займа',
                    select: 'Выберите основание',
                    basis: {
                        receipt: {
                            title: 'На основании расписки',
                            date: 'Дата составления расписки'
                        },
                        contract: {
                            title: 'На основании договора займа',
                            number: '№ договора',
                            date: 'Дата составления договора'
                        }
                    }
                },
                car_data: {
                    title: 'Сведения о транспортном средстве',
                    brand: 'Марка транспортного средства',
                    model: 'Модель транспортного средства',
                    state_registration_number: 'ГРНЗ (регистрационный номер)',
                    vin_code: 'VIN код (номер кузова)',
                    year_of_release: 'Год выпуска',
                    body_color: {
                        title: 'Цвет кузова',
                        select: 'Выберите цвет кузова'
                    },
                    amount: 'Стоимость транспортного средства'
                },
                alimony_data: {
                    children: {
                        title: 'Сведения о детях',
                        child: 'Ребенок',
                        add: 'Добавить еще'
                    },
                },
                rent: {
                    title: 'Условия аренды',
                    payment_format: {
                        title: 'Формат оплаты аренды',
                        select: 'Выберите формат оплаты аренды',
                        daily: {
                            title: 'На ежедневной основе',
                        },
                        monthly: {
                            title: 'На ежемесячной основе',
                        }
                    },
                    amount: 'Арендная плата',
                    start_date: 'Дата начала аренды',
                    period: 'Срок аренды (в месяцах)'
                }
            }
        },

        document_settings: {
            title: 'Настройка документов'
        }
    }
}